hugo/public/singleboard/recover-image/index.html
<!DOCTYPE html>
<html lang="ja">
<head><meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
<title>誤ってパーティションテーブル (LBA 0) を消して(0クリアして)しまった場合の対処 - 公開技術情報</title>
<meta name="generator" content="Hugo 0.118.2">
<link href="https://ifritjp.github.io/documentsindex.xml" rel="alternate" type="application/rss+xml">
<link rel="canonical" href="https://ifritjp.github.io/documents/singleboard/recover-image/">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/theme.min.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/chroma.min.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/custom.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/highlight_lns.css">
<meta property="og:title" content="誤ってパーティションテーブル (LBA 0) を消して(0クリアして)しまった場合の対処" />
<meta property="og:description" content="raspberry pi のイメージを PC でバックアップしたとき、 SD CARD のパーティションテーブル(LBA 0)を消してしまった。 もちろん意図して消した訳ではない。 むしろ" />
<meta property="og:type" content="article" />
<meta property="og:url" content="https://ifritjp.github.io/documents/singleboard/recover-image/" /><meta property="article:section" content="singleboard" />

<meta property="og:site_name" content="公開技術情報" />
<meta name="twitter:card" content="summary"/>
<meta name="twitter:title" content="誤ってパーティションテーブル (LBA 0) を消して(0クリアして)しまった場合の対処"/>
<meta name="twitter:description" content="raspberry pi のイメージを PC でバックアップしたとき、 SD CARD のパーティションテーブル(LBA 0)を消してしまった。 もちろん意図して消した訳ではない。 むしろ"/>
<meta itemprop="name" content="誤ってパーティションテーブル (LBA 0) を消して(0クリアして)しまった場合の対処">
<meta itemprop="description" content="raspberry pi のイメージを PC でバックアップしたとき、 SD CARD のパーティションテーブル(LBA 0)を消してしまった。 もちろん意図して消した訳ではない。 むしろ">

<meta itemprop="wordCount" content="1302">
<meta itemprop="keywords" content="" />
</head>
<body><div class="container"><header>
<h1>公開技術情報</h1>


[<a href="https://ifritjp.github.io/documents/en/">English</a>]

[<a href="https://ifritjp.github.io/documents/">Japanese</a>]

</header>
<div class="global-menu">
<nav>
<ul>
<li><a href="/documents/">Home</a></li>
<li><a href="https://ifritjp.github.io/blog2/public/">blog</a></li>
<li><a href="https://ifritjp.github.io/LuneScript-webFront/lnsc_web_frontend/for_wasm/">LuneScript on Web</a></li></ul>
</nav>
</div>
<div class="content-container">
<main><h1>誤ってパーティションテーブル (LBA 0) を消して(0クリアして)しまった場合の対処</h1>

<p>
raspberry pi のイメージを PC でバックアップしたとき、
SD CARD のパーティションテーブル(LBA 0)を消してしまった。</p>
<p>
もちろん意図して消した訳ではない。
むしろ、消していることに気が付かずに、
SD CARD を raspberry pi に戻して再起動させた時に起動しなくなっていて、
意味が分からずかなり焦った。</p>
<p>
起動しない原因がパーティションテーブルを消していたことだと気付くのに、
かなりの時間を要した。</p>
<p>
そんな訳で、パーティションテーブルを復旧させる方法を説明する。</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
パーティションテーブル復旧方法
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>
パーティションテーブル復旧方法の手順は次の通り。</p>
<ul>
<li>物理パーティションの場所を特定する</li>
<li>マウントして中身を確認する</li>
<li>PARTUUID を復旧する</li>
<li>fsck する  </li>
</ul>
<p>以降、それぞれの対応手順を説明する。</p>
<p>
復旧処理中にデータを壊してしまう可能性があるため、
以降では <strong>バックアップを取ったイメージファイルに対して処理</strong> を行なうものとする。</p>
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
物理パーティションの場所を特定する
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>
パーティションテーブルの主な役割は、
物理パーティションの場所を示すことである。</p>
<p>
つまり、物理パーティションがどこにあるのかを調べなければならない。</p>
<p>
この作業を行なってくれるツールとして testdisk がある。</p>
<p>
testdisk に関しては、次の URL を参考にすること。</p>
<p>
https://www.atmarkit.co.jp/flinux/rensai/linuxtips/991testdisk.html</p>
<p>
上記 URL の手順と違うのは、
起動する際のコマンドオプションとして
以下のようにバックアップファイル名を指定する。</p>
<pre class="example">
$ sudo testdisk /log /backupfile.img
</pre>
<p>
<strong>testdisk で物理パーティションが見つからなかった場合は、次の方法を試す。</strong></p>
<div id="outline-container-headline-3" class="outline-4">
<h4 id="headline-3">
testdisk で物理パーティションを見つけられなかった場合
</h4>
<div id="outline-text-headline-3" class="outline-text-4">
<p>
raspberry pi をインストールする際に使用した元のイメージファイルに対し fdisk する。</p>
<pre class="example">
$ fdisk /org_image.img
</pre>
<p>
パーティション情報を確認する。</p>
<pre class="example">
Command (m for help): p
Disk org_image.img: 1.75 GiB, 1858076672 bytes, 3629056 sectors
Units: sectors of 1 * 512 = 512 bytes
Sector size (logical/physical): 512 bytes / 512 bytes
I/O size (minimum/optimal): 512 bytes / 512 bytes
Disklabel type: dos
Disk identifier: 0x067e19d7

Device         Boot  Start     End Sectors  Size Id Type
org_image.img1        8192  532479  524288  256M  c W95 
org_image.img2      532480 3629055 3096576  1.5G 83 Linu
</pre>
<p>
このパーティション情報を元に、バックアップファイルのパーティション情報を設定する。</p>
<pre class="example">
$ fdisk /backupfile.img
</pre>
<p>
ただし、パーティション 2 の End 位置は、オリジナルと異なる。
基本的に End 位置は、最大サイズになるように設定しておけば良い。</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
マウント
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>
パーティションが見付かったら、そのパーティションをマウントする。</p>
<p>
マウントする場合、次のコマンドを実行する。</p>
<pre class="example">
$ sudo mkdir -p /mnt/recovery
$ sudo mount -o loop,offset=272629760 /backupfile.img /mnt/recovery
</pre>
<p>
ここで offset には、パーティションの開始セクタ番号 x 512 を指定する。</p>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
PARTUUID を復旧する
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>
物理パーティションの情報が復旧できても、
PARTUUID が復旧できていないと、ブートできない。</p>
<p>
そこで、 fstab に記載されている PARTUUID を確認する。</p>
<pre class="example">
$ cat /mnt/recovery/etc/fstab 
PARTUUID=3729482f-01  /boot           vfat    defaults          0       2
PARTUUID=3729482f-02  /               ext4    defaults,noatime  0       1
</pre>
<p>
この 3729482f を PARTUUID に設定する。</p>
<pre class="example">
$ fdisk /backupfile.img 

Welcome to fdisk (util-linux 2.34).
Changes will remain in memory only, until you decide to write them.
Be careful before using the write command.


Command (m for help): x

Expert command (m for help): i

Enter the new disk identifier: 0x3729482f

Expert command (m for help): r

Command (m for help): w
</pre>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
fsck
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>
念のため fsck を掛けてファイルが壊れていないか確認する。</p>
<p>
マウントされていると fsck を掛けられないので解除する。</p>
<pre class="example">
$ df
Filesystem      1K-blocks       Used Available Use% Mounted on
/dev/loop0       15022248   12407452   1972256  87% /mnt/recovery
$ sudo umount /dev/loop0
</pre>
<p>
次に loop デバイスにイメージを設定。</p>
<pre class="example">
$ sudo losetup /dev/loop0 --offset 272629760 /backupfile.img
</pre>
<p>
そして loop デバイスを fsck。</p>
<pre class="example">
$ sudo fsck -a /dev/loop0
</pre>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
バックアップファイルを SD カードに書き戻す
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<p>
以上で、バックアップファイル内のパーティションテーブルの復旧が出来たので、
SDカードにバックアップファイルを書き戻す。</p>
<p>
なお、 fsck で問題が出ていなかった場合、LBA 0 だけ書き戻せば良い。</p>
<p>
以上。</p>
</div>
</div>
</div>
</div>
<div class="edit-meta">

<br></div><nav class="pagination"><a class="nav nav-prev-2" href="https://ifritjp.github.io/documents/singleboard/usb-gadget/" title="USB Gadget 機能を利用して Raspberry Pi を HID Keyboard と RNDIS の複合デバイスにする"><i class="fas fa-arrow-left" aria-hidden="true"></i> Prev - USB Gadget 機能を利用して Raspberry Pi を HID Keyboard と RNDIS の複合デバイスにする</a>
<a class="nav nav-next-2" href="https://ifritjp.github.io/documents/lunescript/" title="トランスコンパイラ LuneScript で Lua の開発をもっと楽に!!">Next - トランスコンパイラ LuneScript で Lua の開発をもっと楽に!! <i class="fas fa-arrow-right" aria-hidden="true"></i></a>
</nav><footer><p class="powered">Powered by <a href="https://gohugo.io">Hugo</a>. Theme by <a href="https://themes.gohugo.io/hugo-theme-techdoc/">TechDoc</a>. Designed by <a href="https://github.com/thingsym/hugo-theme-techdoc">Thingsym</a>.</p>
</footer>
</main><div class="sidebar">

<nav class="slide-menu">
<ul>
<li class=""><a href="https://ifritjp.github.io/documents">Home</a></li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/lctags/">C/C&#43;&#43; ソースコードタグシステム lctags の紹介<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/lctags/introduce/">C/C&#43;&#43; ソースコードタグシステム lctags の紹介</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/rename/">C/C&#43;&#43; ソースコードをリファクタリング by lctags on emacs (リネーム編)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/enum/">C/C&#43;&#43; の enum 補完 by lctags on emacs</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/highlight/">C/C&#43;&#43; の特定シンボルをハイライト by lctags on emacs</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/varsize/">C/C&#43;&#43; の変数サイズ確認 by lctags on emacs</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/callgraph/">C言語/C&#43;&#43; コードを解析してインタラクティブなコールグラフ表示 by lctags</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/modulegraph/">C言語/C&#43;&#43; コードを解析してインタラクティブなモジュール構成図っぽいグラフ表示 by lctags</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/callfunc/">lctags で C 言語の関数コールを簡単に</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/register/">lctags のプロジェクト簡易登録</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/c-language/">lctags を開発している時に改めて感じた C 言語規格のイケてないところ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/subroutine/">lctags を使って C/C&#43;&#43; ソースコードをリファクタリング(サブルーチン化編)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/windows/">Windows で lctags (C言語/C&#43;&#43; のタグジャンプ、コールグラフ、etc..)</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/lua/">C/C&#43;&#43; 言語プログラマのための Lua 入門リファレンス<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/lua/detail/">C インタフェース詳細編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/interface/">C インタフェース編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/fengari/">fengari の使い方 (Lua を Web ブラウザで動かす方法)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/lua5.4/">Lua 5.4 の主な変更点</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/anti-pattern/">Lua でやりがちなミス</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/pointer/">ポインタ編</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/emacs/">Emacs<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/emacs/simple-httpd/">emacs 簡易 HTTPD 化パケージ simple-httpd.el</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/emacs/company-mode/">自作言語 (LuneScript) の emacs company-mode backend 設定</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/go/">Goes<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/go/package/">Go のパッケージ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/go/guide/">Go 入門</a></li>
</ul>
  
</li>

<li class=""><a href="https://ifritjp.github.io/documents/gcp/">Google Cloud Platform を使ってみる</a>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/javascript/">Javascripts<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/javascript/d3force/">D3.js V4 forceSimulation のノード動的更新(追加・削除)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/javascript/thread/">JavaScript のスレッド(非同期処理)</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/libclang/">Lua で C/C&#43;&#43; の構文解析 (libclang の Lua binding)<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/libclang/operator/">libclang で演算子を特定する方法</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/libclang/ast/">libclang の AST(Abstract Syntax Tree)</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/rust/">Rusts<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/rust/lifetime/">C/C&#43;&#43;エンジニアのための Rust のデータ所有権とライフタイム入門</a></li>
</ul>
  
</li>

<li class="parent has-sub-menu"><a href="https://ifritjp.github.io/documents/singleboard/">Singleboards<span class="mark opened">-</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/raspios64-point/">64bit 版 Raspberry Pi OS でカーネルモジュールを使った際に遭遇したエラーと対応方法</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/build-kernel-module-64/">64bit 版 Raspberry Pi OS のカーネルモジュールのビルド環境設定</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/bluetooth-a2dp-receiver/">Raspberry Pi で Bluetooth レシーバー (オーディオ:A2DP) を作成するための設定方法解説</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/usb-gadget/">USB Gadget 機能を利用して Raspberry Pi を HID Keyboard と RNDIS の複合デバイスにする</a></li>
<li class="active"><a href="https://ifritjp.github.io/documents/singleboard/recover-image/">誤ってパーティションテーブル (LBA 0) を消して(0クリアして)しまった場合の対処</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/lunescript/">トランスコンパイラ LuneScript で Lua の開発をもっと楽に!!<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tutorial1/">00. はじめに</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tutorial2.setup/">01. 導入編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tutorial3.hello/">02. Hello world</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/crosscompile/">03. Lua バージョン間のクロスコンパイル</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/value/">04. 値編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/set/">04.2. Set 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tuple/">04.3 タプル編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/enum/">05. enum 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/match/">06. match 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/variable/">07. 変数 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/branch/">08. 一般分岐構文 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/loop/">09. 繰り返し構文 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/func/">10. 関数 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/multipleretval/">10.2. 多値の戻り値</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/defaultarg/">10.3. 引数の省略 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/arg/">10.4. 可変長引数、戻り値 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/closure/">10.5. クロージャ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/error/">10.6. エラーハンドリング編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/nilable/">11. nilable 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/class1/">12. クラス 基本 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/class2accessor/">13. accessor 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classinherit/">14. クラス 継承 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classadvertise/">15. クラス advertise 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classoverride/">16. クラス override 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/interface/">17. インタフェース 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classmapping/">18. mapping 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/generics/">19. generics 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/generics-go/">19.2. generics (2つの collection 型) 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/nilcond/">20. nil 条件演算子 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/import/">21. import/provide 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/require/">22. require/module 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/glue/">22.1. glue コードの半自動生成</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lua/">22.2. Lua と連携 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/make/">23. ビルド 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/macro/">24. マクロ 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/cast/">25. キャスト 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/subfile/">26. subfile 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lazyloading/">27. 遅延ロード 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/shebang_main/">28. shebang とコマンドライン引数</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/dir/">29. LuneScript を利用するプロジェクトの推奨ディレクトリ構成</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go/">80. Go 言語へのトランスコンパイル</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go_package/">80.2 Go 言語へのトランスコンパイル時のパッケージ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lua_runtime/">80.3 Go へトランスコンパイルした際の Lua ランタイム</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go_wasm/">80.4 LuneScript の WebAssembly 対応</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/async/">81. 安全な非同期処理</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/async_old/">81.1 非同期処理(過去情報)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/luago/">82. Lua と連携 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/ebnf/">A. BNF</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lnstags/">A. lnstags によるタグジャンプ (ソースコードタグシステム)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/reason/">A. Lua のトランスコンパイラ LuneScript を開発した理由</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/regret/">A. LuneScript の言語仕様でミスだったと思っているところ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/onweb/">A. Web ブラウザ上で動作する LuneScript</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/recommend/">A. トランスコンパイラ開発のすゝめ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/completion/">A.イマドキな開発環境でもっと楽しよう</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/box/">Box 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/test/">X. 言語開発の品質コントロールにおけるセルフホスティングの重要性とテスト設計</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/design/">Y.1 LuneScript の開発方法</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/design-2/">Y.2 LuneScript の開発(型情報管理)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/design-3/">Y.3 LuneScript の開発(スコープとシンボル)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go_study/">Z. Go 言語へのトランスコンパイル (検討段階)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/all/">全文検索用結合ファイル</a></li>
</ul>
  
</li>

<li class=""><a href="https://ifritjp.github.io/documents/misc/">細かいメモ</a>
  
</li>
</ul>
</nav>



<div class="sidebar-footer"></div>
</div>
</div><a href="#" id="backtothetop-fixed" class="backtothetop"
 data-backtothetop-duration="600"
 data-backtothetop-easing="easeOutQuart"
 data-backtothetop-fixed-fadeIn="1000"
 data-backtothetop-fixed-fadeOut="1000"
 data-backtothetop-fixed-bottom="10"
 data-backtothetop-fixed-right="20">
<span class="fa-layers fa-fw">
<i class="fas fa-circle"></i>
<i class="fas fa-arrow-circle-up"></i>
</span></a>
</div>
</body>
</html>
